from datetime import date
from typing import Final

from nltk.stem.snowball import RussianStemmer  # type: ignore

RU_STEMMER: Final[RussianStemmer] = RussianStemmer()

__all__ = [
    "stem_all",
    "MONTH_NUM_2_NAME",
    "MONTH_NUM_2_NAME_STEM",
    "MONTH_NAME_2_NUM",
    "DAY_NAME_2_NUM",
    "DAY_NUM_2_NAME",
]


def stem_all(sentence: str) -> str:
    return " ".join(
        RU_STEMMER.stem(word.strip()) for word in sentence.split(" ") if word.strip()
    )


MONTH_NUM_2_NAME: Final[dict[int, list[str]]] = {
    1: ["январь", "январю", "января", "январем", "январе", "янв", "янвя"],
    2: ["февраль", "февралю", "февраля", "февралем", "феврале", "фев"],
    3: ["март", "марту", "марта", "мартом", "марте"],
    4: ["апрель", "апрелю", "апреля", "апрелем", "апреле", "апр"],
    5: ["май", "маю", "мая", "маем", "мае"],
    6: ["июнь", "июню", "июня", "июнем", "июне"],
    7: ["июль", "июлю", "июля", "июлем", "июле"],
    8: ["август", "августу", "августа", "августом", "августе", "авг"],
    9: ["сентябрь", "сентябрю", "сентября", "сентябрем", "сентябре", "сент"],
    10: ["октябрь", "октябрю", "октября", "октябрем", "октябре", "окт"],
    11: ["ноябрь", "ноябрю", "ноября", "ноябрем", "ноябре", "нояб"],
    12: ["декабрь", "декабрю", "декабря", "декабрем", "декабре", "дек"],
}

MONTH_NUM_2_NAME_STEM: Final[dict[int, set[str]]] = {
    num: {RU_STEMMER.stem(m_name) for m_name in m_names}
    for num, m_names in MONTH_NUM_2_NAME.items()
}

MONTH_NAME_2_NUM: Final[dict[str, int]] = {
    word: num for num, words in MONTH_NUM_2_NAME_STEM.items() for word in words
}

SEPARATOR: Final[str] = r" /|.-"
SEPARATOR_R: Final[str] = f"[{SEPARATOR}]"
DAY_R: Final[str] = r"\b(3[01]|[12][0-9]|0?[1-9])\b"
MONTH_R: Final[str] = r"\b(1[0-2]|0?[1-9])\b"
YEAR_R: Final[str] = r"\b((?:19|20)?[0-9]{2})\b"
MONTH_TEXT_R: Final[str] = r"\b(" + r"|".join(MONTH_NAME_2_NUM) + r")\b"


def full_year(year: int) -> int:
    if year > 100:  # 4 digits
        return year

    cur_year: int = date.today().year
    cur_year_2_digits: int = cur_year % 1000 % 100

    if year <= cur_year_2_digits:
        return (cur_year - cur_year_2_digits) + year

    return (cur_year - cur_year_2_digits - 100) + year


DAY_NUM_2_NAME: Final[dict[int, list[str]]] = {
    1: ["первый", "первого", "первому", "первый", "первым", "первом"],
    2: ["второй", "второго", "второму", "второй", "вторым", "втором"],
    3: ["третий", "третьего", "третьему", "третий", "третьим", "третьем"],
    4: ["четвёртый", "четвёртого", "четвёртому", "четвёртый", "четвёртым", "четвёртом"],
    5: ["пятый", "пятого", "пятому", "пятый", "пятым", "пятом"],
    6: ["шестой", "шестого", "шестому", "шестой", "шестым", "шестом"],
    7: ["седьмой", "седьмого", "седьмому", "седьмой", "седьмым", "седьмом"],
    8: ["восьмой", "восьмого", "восьмому", "восьмой", "восьмым", "восьмом"],
    9: ["девятый", "девятого", "девятому", "девятый", "девятым", "девятом"],
    10: ["десятый", "десятого", "десятому", "десятый", "десятым", "десятом"],
    11: [
        "одиннадцатый",
        "одиннадцатого",
        "одиннадцатому",
        "одиннадцатый",
        "одиннадцатым",
        "одиннадцатом",
    ],
    12: [
        "двенадцатый",
        "двенадцатого",
        "двенадцатому",
        "двенадцатый",
        "двенадцатым",
        "двенадцатом",
    ],
    13: [
        "тринадцатый",
        "тринадцатого",
        "тринадцатому",
        "тринадцатый",
        "тринадцатым",
        "тринадцатом",
    ],
    14: [
        "четырнадцатый",
        "четырнадцатого",
        "четырнадцатому",
        "четырнадцатый",
        "четырнадцатым",
        "четырнадцатом",
    ],
    15: [
        "пятнадцатый",
        "пятнадцатого",
        "пятнадцатому",
        "пятнадцатый",
        "пятнадцатым",
        "пятнадцатом",
    ],
    16: [
        "шестнадцатый",
        "шестнадцатого",
        "шестнадцатому",
        "шестнадцатый",
        "шестнадцатым",
        "шестнадцатом",
    ],
    17: [
        "семнадцатый",
        "семнадцатого",
        "семнадцатому",
        "семнадцатый",
        "семнадцатым",
        "семнадцатом",
    ],
    18: [
        "восемнадцатый",
        "восемнадцатого",
        "восемнадцатому",
        "восемнадцатый",
        "восемнадцатым",
        "восемнадцатом",
    ],
    19: [
        "девятнадцатый",
        "девятнадцатого",
        "девятнадцатому",
        "девятнадцатый",
        "девятнадцатым",
        "девятнадцатом",
    ],
    20: [
        "двадцатый",
        "двадцатого",
        "двадцатому",
        "двадцатый",
        "двадцатым",
        "двадцатом",
    ],
    21: [
        "двадцать первый",
        "двадцать первого",
        "двадцать первому",
        "двадцать первый",
        "двадцать первым",
        "двадцать первом",
    ],
    22: [
        "двадцать второй",
        "двадцать второго",
        "двадцать второму",
        "двадцать второй",
        "двадцать вторым",
        "двадцать втором",
    ],
    23: [
        "двадцать третий",
        "двадцать третьего",
        "двадцать третьему",
        "двадцать третий",
        "двадцать третьему",
        "двадцать третьему",
    ],
    24: [
        "двадцать четвёртый",
        "двадцать четвёртого",
        "двадцать четвёртому",
        "двадцать четвёртый",
        "двадцать четвёртым",
        "двадцать четвёртом",
    ],
    25: [
        "двадцать пятый",
        "двадцать пятого",
        "двадцать пятому",
        "двадцать пятый",
        "двадцать пятым",
        "двадцать пятым",
    ],
    26: [
        "двадцать шестой",
        "двадцать шестого",
        "двадцать шестому",
        "двадцать шестой",
        "двадцать шестым",
        "двадцать шестом",
    ],
    27: [
        "двадцать седьмой",
        "двадцать седьмого",
        "двадцать седьмому",
        "двадцать седьмой",
        "двадцать седьмым",
        "двадцать седьмом",
    ],
    28: [
        "двадцать восьмой",
        "двадцать восьмого",
        "двадцать восьмому",
        "двадцать восьмой",
        "двадцать восьмым",
        "двадцать восьмом",
    ],
    29: [
        "двадцать девятый",
        "двадцать девятого",
        "двадцать девятому",
        "двадцать девятый",
        "двадцать девятым",
        "двадцать девятом",
    ],
    30: [
        "тридцатый",
        "тридцатого",
        "тридцатому",
        "тридцатый",
        "тридцатым",
        "тридцатом",
    ],
    31: [
        "тридцать первый",
        "тридцать первого",
        "тридцать первому",
        "тридцать первый",
        "тридцать первым",
        "тридцать первом",
    ],
}

DAY_NUM_2_NAME_STEM: Final[dict[int, set[str]]] = {
    num: {stem_all(day_name) for day_name in day_names}
    for num, day_names in DAY_NUM_2_NAME.items()
}

DAY_NAME_2_NUM: Final[dict[str, int]] = {
    word: num for num, words in DAY_NUM_2_NAME_STEM.items() for word in words
}


DAY_TEXT_R: Final[str] = r"\b(" + r"|".join(DAY_NAME_2_NUM) + r")\b"
